In [333]:
import pandas as pd

person = {
    "first": "Mykas",
    "last": "RUtkauskas",
    "email": "myk.rut@milo.lt"
}

In [334]:
people = {
    "first": ["Mykas"],
    "last": ["RUtkauskas"],
    "email": ["myk.rut@milo.lt"]
}

In [335]:
people = {
    "first": ["Mykas", "Jane", "Tim"],
    "last": ["RUtkauskas", "Anders", "Johnson"],
    "email": ["myk.rut@milo.lt", "janders@yahoo.com", "timjogn@gmail.com"]
}

In [336]:
people["email"]

['myk.rut@milo.lt', 'janders@yahoo.com', 'timjogn@gmail.com']

In [337]:
df= pd.DataFrame(people)

In [338]:
df

   first        last              email
0  Mykas  RUtkauskas    myk.rut@milo.lt
1   Jane      Anders  janders@yahoo.com
2    Tim     Johnson  timjogn@gmail.com

In [339]:
df.set_index("email", inplace=True)

In [340]:
df.index

Index(['myk.rut@milo.lt', 'janders@yahoo.com', 'timjogn@gmail.com'], dtype='object', name='email')

In [341]:
df.loc["myk.rut@milo.lt":"janders@yahoo.com", ["last", "first"]]

                         last  first
email
myk.rut@milo.lt    RUtkauskas  Mykas
janders@yahoo.com      Anders   Jane

In [342]:
df.iloc[0:2, 0:3]

                   first        last
email
myk.rut@milo.lt    Mykas  RUtkauskas
janders@yahoo.com   Jane      Anders

In [343]:
df.reset_index(inplace=True)

In [344]:
df

               email  first        last
0    myk.rut@milo.lt  Mykas  RUtkauskas
1  janders@yahoo.com   Jane      Anders
2  timjogn@gmail.com    Tim     Johnson

In [345]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [346]:
df = df[["email", "last", "first"]]

In [347]:
df

               email        last  first
0    myk.rut@milo.lt  RUtkauskas  Mykas
1  janders@yahoo.com      Anders   Jane
2  timjogn@gmail.com     Johnson    Tim

In [348]:
filt= (df["last"]== 'Anders') & (df["first"]=="Jane")

In [349]:
df[filt]

               email    last first
1  janders@yahoo.com  Anders  Jane

In [350]:
df.loc[filt, "email"]

1    janders@yahoo.com
Name: email, dtype: object

In [351]:
filt= (df["last"]== 'Anders') | (df["first"]=="Mykas")

In [352]:
df[filt]

               email        last  first
0    myk.rut@milo.lt  RUtkauskas  Mykas
1  janders@yahoo.com      Anders   Jane

In [353]:
df.loc[~filt, "email"]

2    timjogn@gmail.com
Name: email, dtype: object

In [354]:
df.columns

Index(['email', 'last', 'first'], dtype='object')

In [355]:
df.columns = ["emailas", "last_name", "first name"]

In [356]:
df

             emailas   last_name first name
0    myk.rut@milo.lt  RUtkauskas      Mykas
1  janders@yahoo.com      Anders       Jane
2  timjogn@gmail.com     Johnson        Tim

In [357]:
df.columns = [x.upper() for x in df.columns]

In [358]:
df

             EMAILAS   LAST_NAME FIRST NAME
0    myk.rut@milo.lt  RUtkauskas      Mykas
1  janders@yahoo.com      Anders       Jane
2  timjogn@gmail.com     Johnson        Tim

In [359]:
df.columns = df.columns.str.replace("_", " ")

In [360]:
df

             EMAILAS   LAST NAME FIRST NAME
0    myk.rut@milo.lt  RUtkauskas      Mykas
1  janders@yahoo.com      Anders       Jane
2  timjogn@gmail.com     Johnson        Tim

In [361]:
df.columns = [x.lower() for x in df.columns]

In [362]:
df

             emailas   last name first name
0    myk.rut@milo.lt  RUtkauskas      Mykas
1  janders@yahoo.com      Anders       Jane
2  timjogn@gmail.com     Johnson        Tim

In [363]:
df.rename(columns = {"emailas":"emailasas", "first name" : "vardas" }, inplace = True)

In [364]:
df

           emailasas   last name vardas
0    myk.rut@milo.lt  RUtkauskas  Mykas
1  janders@yahoo.com      Anders   Jane
2  timjogn@gmail.com     Johnson    Tim

In [365]:
df.loc[1]

emailasas    janders@yahoo.com
last name               Anders
vardas                    Jane
Name: 1, dtype: object

In [366]:
df.loc[1] = ["janderis@yahooo.com", "Andersas", "Janesas"]

In [367]:
df.loc[1]

emailasas    janderis@yahooo.com
last name               Andersas
vardas                   Janesas
Name: 1, dtype: object

In [368]:
df

             emailasas   last name   vardas
0      myk.rut@milo.lt  RUtkauskas    Mykas
1  janderis@yahooo.com    Andersas  Janesas
2    timjogn@gmail.com     Johnson      Tim

In [369]:
df.loc[2, ["last name", "vardas"]] = ["Vasil", "Joe"]

In [370]:
df

             emailasas   last name   vardas
0      myk.rut@milo.lt  RUtkauskas    Mykas
1  janderis@yahooo.com    Andersas  Janesas
2    timjogn@gmail.com       Vasil      Joe

In [414]:
filt =(df["emailasas"] == "myk.rut@milo.lt")
df.loc[filt, "vardas"] = "Kazys"

In [415]:

df

             emailasas   last name   vardas  pinigai
0      myk.rut@milo.lt  RUtkauskas    Kazys    200.0
1  janderis@yahooo.com    Andersas  JANESAS      NaN
2    timjogn@gmail.com       Vasil      JOE      NaN

In [413]:
filt =(df["emailasas"] == "myk.rut@milo.lt")
df[filt]

         emailasas   last name vardas  pinigai
0  myk.rut@milo.lt  RUtkauskas  KAZYS    200.0

In [401]:
df["vardas"] = df["vardas"].str.upper()

In [402]:
df

             emailasas   last name   vardas  pinigai
0      myk.rut@milo.lt  RUtkauskas    KAZYS    200.0
1  janderis@yahooo.com    Andersas  JANESAS      NaN
2    timjogn@gmail.com       Vasil      JOE      NaN

In [403]:
df["vardas"].apply(len)

0    5
1    7
2    3
Name: vardas, dtype: int64

In [404]:
def update_email(emailasas):
    return emailasas.upper()

In [405]:
df["emailasas"].apply(update_email)

0        MYK.RUT@MILO.LT
1    JANDERIS@YAHOOO.COM
2      TIMJOGN@GMAIL.COM
Name: emailasas, dtype: object

In [406]:
df["emailasas"] = df["emailasas"].apply(lambda x: x.lower())

In [407]:
df

             emailasas   last name   vardas  pinigai
0      myk.rut@milo.lt  RUtkauskas    KAZYS    200.0
1  janderis@yahooo.com    Andersas  JANESAS      NaN
2    timjogn@gmail.com       Vasil      JOE      NaN

In [408]:
df["emailasas"].apply(len)

0    15
1    19
2    17
Name: emailasas, dtype: int64

In [409]:
df.apply(len, axis= "columns")

0    4
1    4
2    4
dtype: int64

In [410]:
len(df["emailasas"])

3

In [411]:
df.apply(lambda x: x.min())

emailasas    janderis@yahooo.com
last name               Andersas
vardas                   JANESAS
pinigai                    200.0
dtype: object

In [416]:
df["last name"].replace({"Vasil": "vaso"})

0    RUtkauskas
1      Andersas
2          vaso
Name: last name, dtype: object

In [417]:
df["last name"].map({"Andersas": "Anders"})

0       NaN
1    Anders
2       NaN
Name: last name, dtype: object

In [418]:
df["emailasas"] + " " + ["vardas"]

0        myk.rut@milo.lt vardas
1    janderis@yahooo.com vardas
2      timjogn@gmail.com vardas
Name: emailasas, dtype: object

In [419]:
df["full name"]= df["last name"] + " " + df["emailasas"]

In [420]:
df

,emailasas,last name,vardas,pinigai,full name
0,myk.rut@milo.lt,RUtkauskas,Kazys,200.0,RUtkauskas myk.rut@milo.lt
1,janderis@yahooo.com,Andersas,JANESAS,NaN,Andersas janderis@yahooo.com
2,timjogn@gmail.com,Vasil,JOE,NaN,Vasil timjogn@gmail.com

In [422]:
df.drop(columns=["pinigai"], inplace=True)

In [423]:
df

             emailasas   last name   vardas                     full name
0      myk.rut@milo.lt  RUtkauskas    Kazys    RUtkauskas myk.rut@milo.lt
1  janderis@yahooo.com    Andersas  JANESAS  Andersas janderis@yahooo.com
2    timjogn@gmail.com       Vasil      JOE       Vasil timjogn@gmail.com

In [425]:
df["full name"].str.split(" ", expand= True)

            0                    1
0  RUtkauskas      myk.rut@milo.lt
1    Andersas  janderis@yahooo.com
2       Vasil    timjogn@gmail.com

In [426]:
df[["Last", "email"]] = df["full name"].str.split(" ", expand = True)

In [427]:
df

,emailasas,last name,vardas,full name,Last,email
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt
1,janderis@yahooo.com,Andersas,JANESAS,Andersas janderis@yahooo.com,Andersas,janderis@yahooo.com
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com

In [430]:
df.append({"vardas": "Tony"}, ignore_index=True)

C:\Users\Vartotojas\AppData\Local\Temp\ipykernel_11680\1291960493.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({"vardas": "Tony"}, ignore_index=True)

,emailasas,last name,vardas,full name,Last,email
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt
1,janderis@yahooo.com,Andersas,JANESAS,Andersas janderis@yahooo.com,Andersas,janderis@yahooo.com
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com
3,NaN,NaN,Tony,NaN,NaN,NaN

In [431]:
people = {
    "vardas": ["Otis", "Valentas"],
    "last": ["Verino", "Osovi"],
    "email": ["ot.ver@milo.lt", "val.oso@yahoo.com"]
}

df2 = pd.DataFrame(people)

In [432]:
df2

     vardas    last              email
0      Otis  Verino     ot.ver@milo.lt
1  Valentas   Osovi  val.oso@yahoo.com

In [435]:
df = df.append(df2, ignore_index=True, sort = False)

C:\Users\Vartotojas\AppData\Local\Temp\ipykernel_11680\2517880801.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort = False)

In [436]:
df

,emailasas,last name,vardas,full name,Last,email,last
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt,NaN
1,janderis@yahooo.com,Andersas,JANESAS,Andersas janderis@yahooo.com,Andersas,janderis@yahooo.com,NaN
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com,NaN
3,NaN,NaN,Otis,NaN,NaN,ot.ver@milo.lt,Verino
4,NaN,NaN,Valentas,NaN,NaN,val.oso@yahoo.com,Osovi

In [437]:
df.drop(index=4)

,emailasas,last name,vardas,full name,Last,email,last
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt,NaN
1,janderis@yahooo.com,Andersas,JANESAS,Andersas janderis@yahooo.com,Andersas,janderis@yahooo.com,NaN
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com,NaN
3,NaN,NaN,Otis,NaN,NaN,ot.ver@milo.lt,Verino

In [447]:
filt = df["Last"]=="Andersas"
df.drop(index = df[filt].index)

,emailasas,last name,vardas,full name,Last,email,last
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt,NaN
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com,NaN
3,NaN,NaN,Otis,NaN,NaN,ot.ver@milo.lt,Verino
4,NaN,NaN,Valentas,NaN,NaN,val.oso@yahoo.com,Osovi

In [452]:
filt = df["Last"]=="Vasil"
index = df[filt].index

In [453]:
index

Int64Index([2], dtype='int64')

In [455]:
df.sort_values(by= "Last")

,emailasas,last name,vardas,full name,Last,email,last
1,janderis@yahooo.com,Andersas,JANESAS,Andersas janderis@yahooo.com,Andersas,janderis@yahooo.com,NaN
0,myk.rut@milo.lt,RUtkauskas,Kazys,RUtkauskas myk.rut@milo.lt,RUtkauskas,myk.rut@milo.lt,NaN
2,timjogn@gmail.com,Vasil,JOE,Vasil timjogn@gmail.com,Vasil,timjogn@gmail.com,NaN
3,NaN,NaN,Otis,NaN,NaN,ot.ver@milo.lt,Verino
4,NaN,NaN,Valentas,NaN,NaN,val.oso@yahoo.com,Osovi

In [469]:
df

             emailasas   last name    vardas        Last
0      myk.rut@milo.lt  RUtkauskas     Kazys  RUtkauskas
1  janderis@yahooo.com    Andersas   JANESAS    Andersas
2    timjogn@gmail.com       Vasil       JOE       Vasil
3                  NaN         NaN      Otis         NaN
4                  NaN         NaN  Valentas         NaN

In [470]:
df.sort_values(by = "emailasas")

             emailasas   last name    vardas        Last
1  janderis@yahooo.com    Andersas   JANESAS    Andersas
0      myk.rut@milo.lt  RUtkauskas     Kazys  RUtkauskas
2    timjogn@gmail.com       Vasil       JOE       Vasil
3                  NaN         NaN      Otis         NaN
4                  NaN         NaN  Valentas         NaN

In [473]:
df.loc[4]

emailasas         NaN
last name         NaN
vardas       Valentas
Last              NaN
Name: 4, dtype: object

In [477]:
df.loc[4] = ["valentasas@mil.com", "Marinauskas", "Valentas", "Marin"]
df.loc[3] = ["otos@mil.com", "KAris", "Otis", "Puzinas"]

In [478]:
df

             emailasas    last name    vardas        Last
0      myk.rut@milo.lt   RUtkauskas     Kazys  RUtkauskas
1  janderis@yahooo.com     Andersas   JANESAS    Andersas
2    timjogn@gmail.com        Vasil       JOE       Vasil
3         otos@mil.com        KAris      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin

In [490]:
df["last name"] = df["last name"].str.capitalize()
df["vardas"] = df["vardas"].str.capitalize()
df["Last"] = df["Last"].str.capitalize()

In [491]:
df

             emailasas    last name    vardas        Last
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
1  janderis@yahooo.com     Andersas   Janesas    Andersas
2    timjogn@gmail.com        Vasil       Joe       Vasil
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin

In [494]:
df.sort_values(by= "Last", ascending = False)

             emailasas    last name    vardas        Last
2    timjogn@gmail.com        Vasil       Joe       Vasil
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
1  janderis@yahooo.com     Andersas   Janesas    Andersas

In [495]:
df.sort_values(by= ["Last", "vardas"], ascending = False)

             emailasas    last name    vardas        Last
2    timjogn@gmail.com        Vasil       Joe       Vasil
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
1  janderis@yahooo.com     Andersas   Janesas    Andersas

In [496]:
df.sort_values(by= ["Last", "vardas"], ascending = [False, True])

             emailasas    last name    vardas        Last
2    timjogn@gmail.com        Vasil       Joe       Vasil
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
1  janderis@yahooo.com     Andersas   Janesas    Andersas

In [501]:
df.loc[5]= ["kk@lk.lt", "kkk", "Atas","Puzinas"]

In [502]:
df

             emailasas    last name    vardas        Last
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
1  janderis@yahooo.com     Andersas   Janesas    Andersas
2    timjogn@gmail.com        Vasil       Joe       Vasil
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
5             kk@lk.lt          kkk      Atas     Puzinas

In [505]:
df.sort_values(by= ["Last", "vardas"], ascending = [False, True], inplace=True)

In [506]:
df

             emailasas    last name    vardas        Last
2    timjogn@gmail.com        Vasil       Joe       Vasil
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
5             kk@lk.lt          kkk      Atas     Puzinas
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
1  janderis@yahooo.com     Andersas   Janesas    Andersas

In [507]:
df.sort_index()

             emailasas    last name    vardas        Last
0      myk.rut@milo.lt   Rutkauskas     Kazys  Rutkauskas
1  janderis@yahooo.com     Andersas   Janesas    Andersas
2    timjogn@gmail.com        Vasil       Joe       Vasil
3         otos@mil.com        Karis      Otis     Puzinas
4   valentasas@mil.com  Marinauskas  Valentas       Marin
5             kk@lk.lt          kkk      Atas     Puzinas

In [510]:
df["Last"].sort_values(ascending=True)

1      Andersas
4         Marin
5       Puzinas
3       Puzinas
0    Rutkauskas
2         Vasil
Name: Last, dtype: object